src/cf/InformationRegisters/ОрганизацииВРеестрахДоверенныхКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОрганизацииВРеестрахДоверенныхКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВРеестре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОрганизацииВРеестрахДоверенныхКонтрагентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьСтатусИзРеестраКонтрагентов(ПараметрыПодключения, Контрагент) Экспорт
	
	ИННКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ИНН");
	
	Результат = ТранспортМДЛПАПИКлиентСервер.ПроверитьВхождениеВРеестрДоверенныхКонтрагентов(ПараметрыПодключения, ИННКонтрагента);
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначения.СообщитьПользователю(Результат.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Контрагент = Контрагент;
	Запись.Организация = ПараметрыПодключения.Организация;
	Запись.ВРеестре = Результат.ВРеестре;
	Запись.Записать();
	
КонецПроцедуры

Функция ОрганизацияВРеестреКонтрагента(Организация, Контрагент) Экспорт
	
	Результат = Новый Структура("ВРеестре, ДатаАктуальности", Ложь, Дата(1,1,1));
	
	Таблица = ОрганизацииВРеестрахКонтрагентов(Организация, Контрагент);
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ЗаполнитьЗначенияСвойств(Результат, СтрокаТаблицы);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОрганизацияВРеестрахКонтрагентов(Организация) Экспорт
	
	Результат = Новый Соответствие;
	
	Таблица = ОрганизацииВРеестрахКонтрагентов(Организация, Неопределено);
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Данные = Новый Структура("ВРеестре, ДатаАктуальности");
		ЗаполнитьЗначенияСвойств(Данные, СтрокаТаблицы);
		
		Результат.Вставить(СтрокаТаблицы.Контрагент, Данные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КонтрагентСОрганизациямиВРеестре(Контрагент) Экспорт
	
	Результат = Новый Соответствие;
	
	Таблица = ОрганизацииВРеестрахКонтрагентов(Неопределено, Контрагент);
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Данные = Новый Структура("ВРеестре, ДатаАктуальности");
		ЗаполнитьЗначенияСвойств(Данные, СтрокаТаблицы);
		
		Результат.Вставить(СтрокаТаблицы.Организация, Данные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ОрганизацииВРеестрахКонтрагентов(Организации = Неопределено, Контрагенты = Неопределено)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Т.Контрагент        КАК Контрагент,
	|	Т.Организация       КАК Организация,
	|	Т.ВРеестре          КАК ВРеестре,
	|	Т.ДатаАктуальности  КАК ДатаАктуальности
	|ИЗ
	|	РегистрСведений.ОрганизацииВРеестрахДоверенныхКонтрагентов КАК Т
	|");
	
	Если ЗначениеЗаполнено(Организации) Или ЗначениеЗаполнено(Контрагенты) Тогда
		
		Схема = Новый СхемаЗапроса;
		Схема.УстановитьТекстЗапроса(Запрос.Текст);
		
		Отбор = Схема.ПакетЗапросов[0].Операторы[0].Отбор;
		
		Если ЗначениеЗаполнено(Организации) Тогда
			
			Отбор.Добавить("Т.Организация В (&Организации)");
			
			Запрос.УстановитьПараметр("Организации", Организации);
			
		ИначеЕсли ЗначениеЗаполнено(Контрагенты) Тогда
			
			Отбор.Добавить("Т.Контрагент В (&Контрагенты)");
			
			Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
			
		КонецЕсли;
		
		Запрос.Текст = Схема.ПолучитьТекстЗапроса();
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
